{
  "decks": [
    {
      "id": 1,
      "name": "Rendering in React",
      "description": "React's component structure allows for quickly building a complex web application that relies on DOM manipulation. "
    },
    {
      "name": "React Router",
      "description": "React Router is a collection of navigational components that compose declaratively with your application.",
      "id": 2
    },
     {
      "id": 3,
      "name": "Javascript",
      "description": "Study Q & A related to Javascript that might come up in an interview."
    },
   {
      "id": 4,
      "name": "CSS",
      "description": "CSS questions and answers."
    }
    
  ],
  "cards": [
    {
      "id": 1,
      "front": "Differentiate between Real DOM and Virtual DOM.",
      "back": "Virtual DOM updates are faster but do not directly update the HTML.",
      "deckId": 1
    },
    {
      "id": 2,
      "front": "How do you modify the state of a different React component?",
      "back": "Not at all! State is visible to the component only.",
      "deckId": 1
    },
    {
      "id": 3,
      "front": "How do you pass data 'down' to a React child component?",
      "back": "As properties or props.",
      "deckId": 1
    },
    {
      "front": "Why do we need a Router in React",
      "back": "A Router is used to define multiple routes and when a user types a specific URL, if this URL matches the path of any ‘route’ defined inside the router, then the user is redirected to that particular route.",
      "deckId": 2,
      "id": 4
    },
    {
      "front": "What path will match the follow Route?\n<Route>\n  <NotFound />\n</Route>",
      "back": "All paths. A route with no path matches all URL's",
      "deckId": 2,
      "id": 5
    },
    {
      "front": "What does <Switch> do?",
      "back": "Renders the first matching child <Route> ",
      "deckId": 2,
      "id": 6
    },
     {
      "front": "What are the differences between null and undefined?",
      "back": "'undefined' means, value of the variable is not defined, 'null' means empty or non-existent value which is used by programmers to indicate “no value”",
      "deckId": 3,
      "id": 7
    },
     {
      "front": "What are the differences between == and ===?",
      "back": "'==' will not check types and '===' will check whether both sides are of same type.",
      "deckId": 3,
      "id": 8
    },
     {
      "front": "How would you compare two objects in JavaScript?",
      "back": "Equality check will check whether two objects have same value for same property. To check that, you can get the keys for both the objects. If the number of properties doesn't match, these two objects are not equal. Secondly, you will check each property whether they have the same value. If all the properties have same value, they are equal.",
      "deckId": 3,
      "id": 9
    },
     {
      "front": "What are the properties related to box model?",
      "back": "Technically, height, width, padding and border are part of box model and margin is related to it.",
      "deckId": 4,
      "id": 10
    },
     {
      "front": "What does float do?",
      "back": "Float pushes an element to the sides of a page with text wrapped around it. you can create entire page or a smaller area by using float.",
      "deckId": 4,
      "id": 11
    },
     {
      "front": "What are the differences between visibility hidden and display none",
      "back": "'display: none' removes the element from the normal layout flow and allow other elements to fill in. 'visibility: hidden' tag is rendered, it takes space in the normal flow but doesn't show it.",
      "deckId": 4,
      "id": 12
    }
  ],
  "profile": {
    "name": "typicode"
  }
}
